const SCHEDULE = {
  1: [ // Понедельник (1)
    { pair: 2, time: "09:40 - 11:10", name: "Элективная дисциплина (ФКиС)", type: "практ", teacher: "ст.преп. Коновалов С.Г.", weeks: [4,5,6,7,8,9,10,11,12,13,14,15,16] },
    { pair: 3, time: "11:20 - 12:50", name: "Философия", type: "лек", teacher: "доц. Штанько М.А.", weeks: [3,4,5,6,7,8,9,10,11] },
    { pair: 4, time: "13:00 - 14:30", name: "Философия", type: "практ", teacher: "доц. Штанько М.А.", weeks: [3,4,5,6,7,8,9,10,11,12,13,14,15,16] }
  ],
  2: [ // Вторник (2)
    { pair: 2, time: "09:40 - 11:10", name: "История России", type: "лек", teacher: "преп. Светличная С.А.", weeks: [3,5,7,9] },
    { pair: 3, time: "11:20 - 12:50", name: "История России", type: "практ", teacher: "преп. Светличная С.А.", weeks: [3,4,5,6,7,8,9,10,11] }
  ],
  3: [ // Среда (3)
    { pair: 2, time: "09:40 - 11:10", name: "Дискретная математика", type: "лек", teacher: "проф. Хапов Д.В.", weeks: [4,5,6,7,8,9,10,11,12,13,14,15,16,17] },
    { pair: 3, time: "11:20 - 12:50", name: "Дискретная математика", type: "лаб", teacher: "проф. Хапов Д.В.", weeks: [4,5,6,7,8,9,10,11,12,13,14,15,16,17] }
  ],
  4: [ // Четверг (4)
    { pair: 1, time: "08:00 - 09:30", name: "Иностранный язык", type: "практ", teacher: "доц. Минаева И.Р.", weeks: [4,5,6,7,8,9,10,11,12] },
    { pair: 3, time: "11:20 - 12:50", name: "Элективная дисциплина (ФКиС)", type: "практ", teacher: "ст.преп. Коновалов С.Г.", weeks: [4,5,6,7,8,9,10,11,12,13,14,15,16,17] }
  ],
  5: [ // Пятница (5)
    { pair: 3, time: "11:20 - 12:50", name: "Дискретная математика", type: "лек", teacher: "проф. Хапов Д.В.", weeks: [4,6,8,10] },
    { pair: 4, time: "13:00 - 14:30", name: "Дискретная математика", type: "лаб", teacher: "проф. Хапов Д.В.", weeks: [4,5,6,7,8,9,10,11,12,13,14,15,16] }
  ]
};
